Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཐོས་ནས་ཀྱང་ས་ལ་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་དྲུང་དུ་འདུག་གོ། །
en: which inspired him to descend to the earth and alight at the feet of the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཆོས་ཚིག་གསུམ་བསྟན་ཏེ།
en: The Blessed One taught him three lines of the Dharma:

source: འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་གོ། །
en: “All conditioned things are impermanent.

source: ང་ལ་སེམས་དགའ་བར་གྱིས་ཤིག་དང་དུད་འགྲོའི་སྐྱེ་གནས་དང་བྲལ་བར་འགྱུར་ཡང་སྲིད་དོ་ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Let your mind be filled with joy at the thought of me, and you may even be released from rebirth in the animal realm.”

source: བྱ་དེ་དགའ་བར་གྱུར་ཏེ་ཡུན་རིང་དུ་ཞལ་དུ་བརྟགས་ནས་སོང་བའི་འོག་ཏུ་དེ་སྟེང་གི་ནམ་མཁའ་ལ་འགྲོ་བ་ལས་ཁྲས་བསད་དེ།
en: The peacock was delighted and gazed upon the Buddha’s countenance for a long time. Then, as he flew up into the sky above, he was killed by a falcon.

source: དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ཏེ། དུས་ལས་འདས་ནས་རྒྱལ་པོའི་ཁབ་དེ་ཉིད་དུ་ཚོང་དཔོན་ཞིག་གི་ཁྱིམ་དུ་ཉིང་མཚམས་སྦྱར་ཏེ།
en: He died filled with joy at the thought of the Blessed One, transmigrated, and took rebirth into the family of a trader there in Rājagṛha.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་བྱུང་ནས་ཁྱེའུ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed the wife gave birth to a child.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་། ཁོང་རྩིས་དང་། ཤོད་དགོད་པ་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། སྦ་བ་དང་། དགྲམ་པ་དང་། གོས་བརྟག་པ་དང་། ནོར་བུ་བརྟག་པ་དང་། རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་། སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་སངས་རྒྱས་ལ་དགའ་བ་དང་། ཆོས་ལ་དགའ་བ་དང་། དགེ་འདུན་ལ་དགའ་བར་གྱུར་ནས་དེས་ཕ་མ་ལ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: One day, in admiration for the Buddha, admiration for the Dharma, and admiration for the Saṅgha, he asked for his parents’ permission and went forth.

source: དེ་རབ་ཏུ་བྱུང་ནས་ན་ཚོད་ཀྱིས་ལོ་བདུན་ལོན་པ་ཁོ་ན་ན་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: Though he was just seven years old, he cast away all afflictive emotions and manifested arhatship.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བར་གྱུར་ཏོ། །
en: After he manifested arhatship he became a person of great miracles and great power.

source: དེ་ནས་དེ་རྫུ་འཕྲུལ་གྱིས་འགྲོ་ཞིང་གནས་གཞན་དང་གཞན་དག་ཏུ་སོང་ནས་ལོ་མའི་ནང་དུ་མེ་ཏོག་དང་འབྲས་བུ་རྣམས་བཅུག་སྟེ་ཁྱེར་ཏེ་འོང་ཞིང་དགེ་འདུན་ལ་འབུལ་བར་བྱེད་དོ། །
en: He used his miraculous powers as a means of travel and would scoop flowers and fruits onto large leaves, carry them from one place to another, and bring them as offerings to the saṅgha.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ། དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: When the monks saw all this they were amazed and requested the Blessed One,

source: བཙུན་པ་དགེ་ཚུལ་བ་འདི་ལོ་བདུན་ནས་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས།
en: “Lord, tell us why this one, who went forth as a novice at just seven years of age, cast away all afflictive emotions and manifested arhatship.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཉིད་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་བཀའ་སྩལ་པ།
en: So that they might become disillusioned with saṃsāra, the Blessed One asked them,

source: ཁྱེད་ཀྱིས་ཆེ་གེ་མོ་ཞིག་གི་ཚེ། བྱ་ཞིག་ནམ་མཁའ་ལས་བབས་ནས་ངའི་མདུན་དུ་འདུག་པ་མཐོང་ངམ་གསོལ་པ།
en: “Did you see the bird that descended from the sky and alighted before me some time ago?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Yes, Lord, we saw him.”

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་བྱ་དེ་ང་ལ་སེམས་དགའ་བར་གྱུར་ནས་སོང་བ་ལས་ཁྲས་བསད་དེ།
en: “Monks,” the Blessed One explained, “as that bird departed, filled with joy at the thought of me, he was killed by a falcon,

source: དེ་ང་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ནས་རྒྱལ་པོའི་ཁབ་འདི་ཉིད་དུ་ཚོང་དཔོན་གྱི་རིགས་སུ་སྐྱེས་ནས།
en: and since he died filled with joy at the thought of me, he took birth into the family of a trader in Rājagṛha.

source: ཆེར་སྐྱེས་པ་དང་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: When he grew up he went forth in my very doctrine.

source: དེ་རབ་ཏུ་བྱུང་ནས་ན་ཚོད་ཀྱིས་ལོ་བདུན་པ་ཁོ་ན་ན་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: After he had gone forth, though just seven years old, he cast away all afflictive emotions and manifested arhatship.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་དགེ་ཚུལ་བ་འདིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་བྱར་སྐྱེས་ལགས།
en: “Lord,” the monks asked the Blessed One, “what action did this novice take that ripened into his birth as a bird?

source: ལས་ཅི་བགྱིས་ན་དེ་ལས་ཤི་འཕོས་ནས་མིར་སྐྱེས་ལ། བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས།
en: What action did he take that, after he died, he transmigrated and took rebirth as a human being, and that he pleased the Blessed One, did not displease him,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ཡུལ་ཀཱ་ཤིའི་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ནི་རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒྱལ་པོ་བྱེད་དོ། །
en: “Monks,” the Blessed One recounted, “in times gone by, in the city of Vārāṇasī, King Brahmadatta reigned in Kāśi,

source: ཡུལ་ལུས་འཕགས་ན་ནི་ལུས་འཕགས་ཀྱི་རྒྱལ་པོ་བི་དེ་ཧ་རྒྱལ་པོ་བྱེད་དོ། །
en: and King Videha reigned in Videha.

source: དེ་གཉིས་ཕན་ཚུན་མི་འཐུན་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བྱེད་དོ། །
en: The two did not get along with each other, and from time to time a great many people were killed.

source: དེ་ནས་ཕྱི་ཞིག་ན་ལུས་འཕགས་ཀྱི་རྒྱལ་པོས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་གཡུལ་འགྱེད་པའི་ཕྱིར་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་ཐོག་ཏུ་དྲངས་སོ། །
en: “So it was that one day the king of Videha arrayed the four divisions of his army and advanced to wage war with King Brahmadatta.

source: ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་། བི་དེ་ཧའི་རྒྱལ་པོས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་གཡུལ་འགྱེད་པའི་ཕྱིར། བདག་གི་ཐོག་ཏུ་དྲངས་སོ་ཞེས་ཐོས་སོ། །
en: King Brahmadatta of Kāśi, upon hearing that the king of Videha had arrayed the four divisions of his army and advanced to wage war,

source: ཐོས་ནས་དེས་ཀྱང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། གཡུལ་འགྱེད་པའི་ཕྱིར་བི་དེ་ཧའི་རྒྱལ་པོའི་ཐོག་ཏུ་དྲངས་པ་ལས།
en: likewise arrayed the four divisions of his army and advanced on the king of Videha to wage war.

source: དེ་བི་དེ་ཧའི་རྒྱལ་པོས་དེ་ཐུབ་ཅིང་བརྡུངས་པར་བྱས་ཏེ། ཕམ་པར་བྱས་ཤིང་རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱས་ནས།
en: “He was defeated by the king of Videha, however, and was forced to flee.

source: རྒྱལ་པོ་གཅིག་པུ་ཐར་ཏེ་བྲོས་ནས་ནགས་ཁྲོད་ཅིག་ཏུ་ཞུགས་ཏེ།
en: Only the king was spared, and he fled into the forest.

source: དེ་ལུས་ངལ་བ་དང་ལུས་སྡུག་བསྔལ་བ་ལ་ལུས་ཤིག་ཤིག་པོར་གྱུར་ནས་རྟ་ལས་བབས་ཏེ། དགྲ་ཞུ་དང་འཐབ་བེར་ཕུད་དེ་ས་ལ་བཏིང་བའི་སྟེང་དུ་འདུག་གོ། །
en: His body was tired and aching, so he dismounted from his horse, removed his helmet, pulled off his cloak, spread it out, and sat down on it.

source: ས་ཕྱོགས་དེ་ནས་ཐག་མི་རིང་བ་ཞིག་ན་ནི། རྨ་བྱ་ཞིག་རྨ་བྱ་མོ་དག་གིས་བསྐོར་ཏེ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དེ།
en: “Not far off was a peacock surrounded by peahens. The peacock and peahens enjoyed themselves and coupled,

source: དེ་དེས་མཐོང་ནས་དེ་ལ་སྨོན་པར་གྱུར་ཏེ། འདི་ནི་འདོད་པ་ཡང་སྤྱོད་ལ་འདི་ལ་གནོད་པ་བྱེད་པ་ཡང་ཅི་ཡང་མེད་པས་ན་སྐྱེ་གནས་འདི་ནི་བཟང་པོ་ཞིག་གོ་སྙམ་མོ། །
en: and when he saw them, he was envious. ‘This peacock indulges his desires,’ he thought, ‘and no one does him harm. Such a life is beautiful.’

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མི་བཞུགས་པའི་ཚེ་ན། རང་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Now in times when a blessed one has not arisen in the world, the solitary buddhas appear.

source: རང་སངས་རྒྱས་ཞིག་རྒྱལ་པོ་དེའི་ཐད་ནས་རྒྱང་མི་རིང་བ་ཞིག་ན། ཤིང་ཞིག་གི་དྲུང་ན་རྟེན་ཅིང་འདུག་ནས་རང་སངས་རྒྱས་དེས་དེ་དྲང་བའི་ཕྱིར་ལུད་པ་བསལ་བའི་སྒྲ་ཕྱུང་ངོ་། །
en: So it was that a solitary buddha was leaning up against a tree directly in front of the king. To catch the king’s attention, the solitary buddha made a sound like he was clearing his throat.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་འཇིགས་ཤིང་སྐྲག་སྟེ་ལངས་ནས།
en: When the king heard it, he leapt up in terror, thinking,

source: འདིར་ཡང་ཕ་རོལ་གྱི་དམག་ཚོགས་མ་འོངས་གྲང་སྙམ་པ་ལས།
en: ‘Has my opponent’s army come here?’

source: རྒྱལ་པོ་དེས་ཤིང་ཞིག་གི་དྲུང་ན་རང་སངས་རྒྱས་རྟེན་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: “Then the king saw the solitary buddha leaning on the tree.

source: མཐོང་ནས་ཀྱང་དེ་ལ་སེམས་དགའ་བར་གྱུར་ཏེ།
en: At this sight his mind became filled with joy.

source: འདི་དེ་ལྟར་མི་མེད་པའི་ནགས་ཁྲོད་དུ་དགའ་བ་ལས་ན་འདི་ནི་བདག་ཉིད་ཆེན་པོ་ཞིག་ཡིན་གོར་མ་ཆག་སྙམ་མོ། །
en: ‘He is content in a forest where there are no people,’ he thought. ‘Certainly this is a great soul.’

source: སྔོན་གྱི་རྒྱལ་རིགས་ཀྱི་རྒྱལ་པོ་རྣམས་ཀྱི་ལུགས་ཀྱིས་ན། གང་གི་ཚེ་གཡུལ་འགྱེད་དུ་འགྲོའམ་རི་དགས་ཤོར་དུ་འགྲོ་བ་དེའི་ཚེ་རྟའི་འཕོངས་ལ་ཁ་ཟས་ཅུང་ཟད་ཙམ་བཏགས་ཏེ་འགྲོའོ། །
en: “Now it was the custom of the ancient kings that when they rode into battle or hunted deer, they would pack some food in the side bags of their horses before setting out.

source: རྒྱལ་པོ་དེའི་རྟའི་འཕོངས་ལ་ཡང་ཁ་ཟས་ཅུང་ཟད་ཙམ་བཏགས་པ་ཡོད་དེ། དེས་རང་སངས་རྒྱས་དེ་ལ་བཤོས་གསོལ་ཏོ། །
en: A little such food hung in King Brahmadatta’s horse’s side bag, and he offered these provisions to the solitary buddha.

source: རང་སངས་རྒྱས་དེས་ཀྱང་རྒྱལ་པོ་དེ་སྟེང་གི་ནམ་མཁའ་ལ་ཁྱེར་ནས་འཇིགས་པ་མེད་པའི་གནས་སུ་བཞག་གོ། །དེ་ནས་རྒྱལ་པོ་དེས་སྨོན་ལམ་བཏབ་པ་
en: “The solitary buddha then carried the king up into the sky and established him in a state of fearlessness, whereupon the king prayed,

source: དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་རྨ་བྱར་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may I be born as a peacock.

source: དེའི་ཚེ་རྒྱལ་པོ་ཚངས་པས་བྱིན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྱ་དེ་ཁོ་ན་ཡིན་ཏེ།
en: The one who was King Brahmadatta then is none other than this bird.

source: དེས་དེར་རང་སངས་རྒྱས་ལ་བཤོས་གསོལ་ནས་སྨོན་ལམ་བཏབ་པ་དེས་ན། ད་ལྟར་འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: Because he offered food to the solitary buddha and prayed thus, now he has pleased me and not displeased me.”

source: བྱ་གཉིས་པ་ནི།
en: The Second Bird Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རི་སྤོས་ཀྱི་ངད་ལྡང་ལ་བྱ་ཀུ་མུ་དཱའི་དུས་སྟོན་སྣ་ཚོགས་ཅན་ཞེས་བྱ་བ་ནད་པ་རིང་པོར་མི་ཐོགས་པར་འཆི་བར་འགྱུར་བ་ཞིག་འདུག་གོ། །
en: When the Blessed One was in Śrāvastī, there lived on Gandhamādana Mountain a certain bird named Kumuda­vicitramaha who was sick and sure to die soon.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེ་མཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། བྱ་དེ་ལུང་བསྟན་པའི་དུས་ལ་བབ་སྟེ།
en: The Blessed One thought, “The time has come to teach this bird.

source: འདི་ལས་བརྟེན་ནས་གདུལ་བར་བྱ་བའི་སྐྱེ་བོ་མང་པོ་དྲང་དགོས་སོ་
en: He will be instrumental in guiding a great many disciples.”

source: སྙམ་དུ་དགོངས་ནས། བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རི་སྤོས་ཀྱི་ངད་ལྡང་གིས་ཕྱོགས་བྱ་དེ་འདུག་པ་ནས་ཐག་མི་རིང་བ་ཞིག་ཏུ་བྱོན་ཏེ།
en: With this thought, the Blessed One disappeared from Śrāvastī and arrived on Gandhamādana Mountain not far from where the bird was.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་བྱ་ཙ་ཤ་ལྔ་བརྒྱ་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་སྐོར་བ་བྱེད་པར་འགྱུར་བ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །
en: The Blessed One performed a miracle that caused five hundred Indian roller birds to come and circumambulate the Blessed One.

source: དེ་ནས་བྱ་དེས་བྱ་ཙ་ཤ་ལྔ་བརྒྱ་ལྷགས་ཏེ་བཅོམ་ལྡན་འདས་ལ་སྐོར་བ་བྱེད་པར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་།
en: When the bird saw the five hundred Indian roller birds performing circumambulation, he wished that he could do the same and thought,

source: ཀྱེ་མ་བདག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་བསྐོར་བ་བྱའོ་སྙམ་དུ་དེའི་འདོད་པ་སྐྱེས་སོ། །
en: “I will also circumambulate the Blessed One.”

source: དེ་ནས་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་བཞིན་དུ་ཤི་ནས་ལྷར་སྐྱེས་སོ། །
en: He died with joy in his mind at the thought of the Blessed One and took rebirth as a god.

source: དེ་ལྷར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཆོས་བསྟན་ནས་དེས་བདེན་པ་མཐོང་སྟེ།
en: Having taken birth as a god, he approached the Blessed One, the Blessed One taught the Dharma to him, and he saw the truths.

source: བདེན་པ་མཐོང་ནས་དེ་རང་གི་གནས་སུ་སོང་ངོ་། །
en: After he saw the truths, he went back to where he belongs.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱ་དེའི་རོ་ལས་བརྟེན་ཏེ། དགེ་སློང་གི་འཁོར་གྱི་ནང་དུ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke about the bird’s carcass to Venerable Śāriputra among the assembly of monks.

source: ཤཱ་རིའི་བུ་བྱ་འདིས་ལས་ཅི་ཞིག་བྱས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་བྱར་སྐྱེས་པར་གྱུར་ཅེས་སྨྲས་པ་དང་།
en: “Śāriputra,” he said, “what action did this bird take that ripened into its birth as a bird?”

source: དེ་ཐོས་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སེམས་པ་ལ་ཞུགས་ཏེདེ་རབ་ཀྱི་མཐའི་བསམ་གཏན་གྱི་བར་དུ་སྙོམས་པར་ཞུགས་ཀྱང་དེའི་རྩད་མ་ཆོད་དེ། བྱ་རྣམས་ལས་ཤི་འཕོས་ཤིང་བྱ་རྣམས་སུ་སྐྱེས་པ་འབའ་ཞིག་མཐོང་ངོ་། །
en: As soon as he heard this, Venerable Śāriputra began to reflect, and though he went deep into equipoise and reached the far limits of concentration, he could not see an end to the bird’s sufferings as he died from one life as a bird and transmigrated, only to take birth as a bird again.

source: དེ་ནས་དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Śāriputra rose from his meditation, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and responded to the Blessed One,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་བྱ་འདིའི་རྩད་མ་ཁུམས་ཏེ།
en: “Lord, I have not been able to apprehend the bird’s origins.

source: བྱ་རྣམས་ལས་ཤི་འཕོས་ཤིང་བྱ་རྣམས་སུ་སྐྱེས་པ་འབའ་ཞིག་མཐོང་ལགས་སོ། །
en: I saw him dying from one life as a bird and transmigrating, only to take birth as a bird again.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནི་ཡེ་ཤེས་གཟིགས་པ་ཐོགས་པ་མི་མངའ་བ་ཡེ་ཤེས་གཟིགས་པ་མཐའ་ཡས་པ་ལགས་ན།
en: Lord, your wisdom and vision are unimpeded—your wisdom and vision are infinite.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་བྱ་འདིས་ལས་ཅི་བགྱིས་པ་དང་། ལས་གང་གི་རྣམ་པར་སྨིན་པས་བྱ་འབའ་ཞིག་ཏུ་སྐྱེས་པ་ལུང་བསྟན་དུ་གསོལ།
en: Lord, Blessed One, I implore you, please explain the action this bird took that ripened into his taking birth only as a bird.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་བྱ་འདི་ཉིད་ཀྱིས་ལས་དེ་ལྟ་བུ་བྱས་ཤིང་བསགས་ཏེ།
en: “Monks,” the Blessed One explained, “such are the actions that this bird committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དོན་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གསུང་རབ་ལ་བྱ་འདི་རབ་ཏུ་བྱུང་སྟེ། དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ནས།
en: “Monks, in times gone by, when the one who transcended the levels of the listeners and solitary buddhas, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Arthadarśin was in the world, this bird went forth in his doctrine and served as steward.

source: དེས་སྦྱིན་བདག་དང་སྦྱིན་པ་པོ་རྣམས་ལས་བཟའ་བ་དང་བཏུང་བ་བསླངས་ཏེ།
en: “In this capacity he would solicit food and drink from patrons and donors.

source: ཁྱིམ་པ་ལ་རྟེན་པར་བྱེད་ནས་དགེ་སློང་མང་པོས་བཀག་པ་ལས་དེ་ཁྲོས་ཏེ་སྨྲས་པ།
en: As he was appealing to a householder, a group of monks prevented him. He became irate and shouted,

source: ཁྱེད་ནི་དུད་འགྲོ་བཞིན་དུ་བསམ་མནོ་མེད་པ་ཡིན་ཏེ།
en: ‘You’re like animals—you don’t even think!

source: དགེ་སློང་དག་གིས་བྱ་བ་གང་ཡིན་པ་ལྟར་བྱེད་པ་མ་ཡིན་ནོ། །
en: You don’t act the way that monks should act!’

source: དེ་ནས་ཕྱིས་དེ་འགྱོད་པ་སྐྱེས་ཏེ། དེས་ལས་དེ་ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་ནས། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ་
en: “In time he came to regret this, confessed his mistake, and then practiced pure conduct all his life.

source: འདི་ལྟར་བདག་གིས་སེམས་ཅན་དག་པ་འདི་ལྟ་བུ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་འདི་བདག་ལ་འོང་བར་མ་གྱུར་ཅིག །
en: ‘May I not meet with the results of the wrongful act of speaking harshly to such pure beings.

source: སྟོན་པ་འདི་ཁོ་ན་དང་འདྲ་བ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I please and not displease a teacher even more exalted than this.’

source: དེའི་ཚེ་དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྱ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who served as steward then is none other than this bird.

source: དེས་དེར་དགེ་སློང་དེ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་དུད་འགྲོ་རྣམས་སུ་སྐྱེས་ཏེ།
en: The act of speaking harshly to the monks ripened into his birth as an animal.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་གཟིགས་ཀྱི་རིང་ནས། ངའི་རིང་གི་བར་དུ་དུད་འགྲོ་རྣམས་ལས་ཤི་འཕོས་ཤིང་དུད་འགྲོ་འབའ་ཞིག་ཏུ་སྐྱེས་སོ། །
en: Monks, from the time of the doctrine of the totally and completely awakened Buddha Arthadarśin until my own, he has died, transmigrated, and taken rebirth only as an animal.

source: ད་ནི་ང་ལ་སེམས་དགའ་བ་སྐྱེས་པས་ཤི་འཕོས་ཏེ། དུས་ལས་འདས་ནས་ལྷར་སྐྱེས་སོ། །
en: Now he has died with joy in his mind at the thought of me, transmigrated, and taken rebirth as a god.

source: ལྷར་གྱུར་ནས་ཀྱང་ངའི་ཐད་དུ་འོངས་ཏེ་དེ་ལ་ངས་ཆོས་བསྟན་ཏོ། །
en: After being reborn as a god, he came before me and I taught him the Dharma.

source: དེས་ང་ལས་ཆོས་ཐོས་ནས་བདེན་པ་རྣམས་མཐོང་ངོ་། །
en: He heard the Dharma from me, saw the truths, [and then went back to where he belongs.]

source: དེས་དེར་ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: “At that time he served as steward in accord with the Dharma, and at the time of his death he prayed, ‘

source: བདག་གིས་སྟོན་པ་འདི་ལྟ་བུ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: May I please and not displease a teacher even more exalted than this.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་གཟིགས་དང་། ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Arthadarśin—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་སོ། །
en: that he has pleased me, not displeased me,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: cast away all afflictive emotions, and manifested arhatship.”

source: ལུས་འཕགས་ཞེས་བྱ་བ་ནི།
en: The Story of Majestic Body

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ལུས་འཕགས་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ
en: When the Blessed One was in Śrāvastī, there lived a certain brahmin of high lineage called Majestic Body. He was prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་
en: When the time came for him to marry he took a wife,

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ཏེ
en: and they enjoyed themselves and coupled. As they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་ལ། གསེར་གྱི་ཁ་དོག་ཅན་མགོ་བོ་གདུགས་ལྟར་འདུག་པ་ལག་པ་རིང་བ། དཔྲལ་པའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ་སྣ་ལེགས་པ་སྨིན་མ་སྟུག་པ་ཞིག་བཙས་ཏེ་
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས
en: At the elaborate feast celebrating his birth they asked,

source: ཁྱེའུ་འདིའི་མིང་ཅིར་གདགས་ཞེས་རིགས་དང་འཐུན་པར་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?” And they named him according to their clan, saying,

source: ཁྱེའུ་འདི་བྲམ་ཟེ་ལུས་འཕགས་ཀྱི་བུ་ཡིན་པས་ན། དེའི་ཕྱིར་ཁྱེའུ་འདིའི་མིང་ལྷག་འཕགས་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since this is the brahmin Majestic Body’s child, his name will be More Majestic.”

source: དེ་ནས་ཁྱེའུ་ལྷག་འཕགས་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ནས། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young More Majestic on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཡི་གེ་དང་། བྲམ་ཟེའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས་ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེ
en: As he grew up he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, he became a master of the six types of brahminical activities,

source: དེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ལ་གཞུང་གིས་རྩོད་པ་ཐམས་ཅད་ཀྱང་ཚར་བཅད་དོ། །
en: and in time he mastered the eighteen sciences and he could defeat anyone in debate.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་ལུས་འཕགས་ཀྱི་སེམས་སྐྱེས་པ།
en: One day the brahmin Majestic Body had the thought,

source: མཆོད་སྦྱིན་བྱའོ་སྙམ་མོ། །
en: “I shall perform a sacrifice.”

source: དེའི་འོག་ཏུ་ཡང་སེམས་སྐྱེས་པ།
en: Then another idea occurred to him:
